dokumentacja/edm/P1-DS-Dokumentacja_integracyjna_P1_EDM_20220915_W16/Załącznik nr 3 - Przykłady - wersja 1.16/weryfikujDostepDoDanych/scenariusz 1/Przykład żądania dla dokumentów indeksowanych w P1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xacml="urn:oasis:names:tc:xacml:3.0:core:schema:wd-17" xmlns:xacml-samlp="urn:oasis:names:tc:xacml:3.0:profile:saml2.0:v2:schema:protocol:wd-13">
	<soapenv:Header>
		<wsse:Security>
				<saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
			                ID="_181835fb981efecaf71d80ecd5fc3c74" Version="2.0"
			                IssueInstant="2019-08-26T09:22:05Z">
			    <saml:Issuer>http://csioz.gov.pl/p1/aut</saml:Issuer>
			    <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
			        ...
			    </ds:Signature>
			    <saml:Subject>
			        <saml:NameID Format="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified">2.16.840.1.113883.3.4424.2.6#2017123</saml:NameID>
			        <saml:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:sender-vouches"/>
			    </saml:Subject>
			    <saml:Conditions NotBefore="2019-08-26T09:17:05Z" NotOnOrAfter="2019-08-26T11:17:05Z"/>
			    <saml:AuthnStatement AuthnInstant="2019-08-26T09:22:00Z">
			        <saml:AuthnContext>
			            <saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml:AuthnContextClassRef>
			        </saml:AuthnContext>
			    </saml:AuthnStatement>
			    <saml:AttributeStatement xmlns:xacmlprof="urn:oasis:names:tc:SAML:2.0:profiles:attribute:XACML"
			                             xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			                             xmlns:xs="http://www.w3.org/2001/XMLSchema">
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
			                        Name="urn:oasis:names:tc:SAML:attribute:subject-id"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
			            <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.1.6.2#3241138</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
			                        Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
			            <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.2.3.1#000000001779</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
			                        Name="urn:oasis:names:tc:xacml:1.0:resource:resource-id"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
			            <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.1.1.616#94071712351</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"
			                        Name="urn:oasis:names:tc:xspa:1.0:subject:functional-role"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#string">
			            <saml:AttributeValue xsi:type="xs:string">medical doctor</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"
			                        Name="urn:oasis:names:tc:xacml:1.0:action:action-id"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#string">
			            <saml:AttributeValue xsi:type="xs:string">READ</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"
			                        Name="urn:oasis:names:tc:xacml:2.0:action:purpose"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#string">
			            <saml:AttributeValue xsi:type="xs:string">RECORDMGT</saml:AttributeValue>
			        </saml:Attribute>
			        <saml:Attribute NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"
			                        Name="urn:ihe:iti:xca:2010:homeCommunityId"
			                        xacmlprof:DataType="http://www.w3.org/2001/XMLSchema#anyURI">
			            <saml:AttributeValue xsi:type="xs:anyURI">2.16.840.1.113883.3.4424.15</saml:AttributeValue>
			        </saml:Attribute>
			    </saml:AttributeStatement>
			</saml:Assertion>
			<wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" 
				ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-7BFD6B4C6F28DBA5561571990969499106">
				...	
			</wsse:BinarySecurityToken>
			<ds:Signature Id="SIG-7BFD6B4C6F28DBA5561571990969499110" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				...
			</ds:Signature>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body wsu:Id="id-7BFD6B4C6F28DBA5561571990969499109">
		<xacml-samlp:XACMLAuthzDecisionQueryRequest ID="id1" IssueInstant="2019-10-15T00:00:00" Version="1.0">
			<xacml:Request CombinedDecision="false" ReturnPolicyIdList="false">
				<xacml:Attributes Category="urn:oasis:names:tc:xacml:3.0:attribute-category:resource" xml:id="resources">
					<xacml:Attribute AttributeId="urn:csioz:p1:autoryzacja:idDokumentu" IncludeInResult="true">
						<xacml:AttributeValue DataType="http://www.w3.org/2001/XMLSchema#string">urn:uuid:20744602-ba65-44e9-87ee-abcdef000002</xacml:AttributeValue>
					</xacml:Attribute>
					<xacml:Attribute AttributeId="urn:csioz:p1:autoryzacja:idDokumentu" IncludeInResult="true">
						<xacml:AttributeValue DataType="http://www.w3.org/2001/XMLSchema#string">urn:uuid:5994c1a2-d167-453f-a826-2cf97d9f9bd4</xacml:AttributeValue>
					</xacml:Attribute>
				</xacml:Attributes>
			</xacml:Request>
		</xacml-samlp:XACMLAuthzDecisionQueryRequest>
	</soapenv:Body>
</soapenv:Envelope>